; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	infrared1 - mode
	spectrograph0 - mode
	infrared2 - mode
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	Star6 - direction
	Star8 - direction
	Star1 - direction
	GroundStation7 - direction
	Star11 - direction
	Star5 - direction
	Star9 - direction
	GroundStation0 - direction
	Star10 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Phenomenon18 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star11)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet14)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 GroundStation7)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star9)
	(supports instrument3 infrared2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star10)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet17)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(have_image Star12 spectrograph0)
	(have_image Star13 infrared1)
	(have_image Planet14 infrared1)
	(have_image Star15 infrared2)
	(have_image Phenomenon16 spectrograph0)
	(have_image Planet17 infrared1)
	(have_image Phenomenon18 spectrograph0)
))

)

; plan
1. (turn_to satellite1 groundstation7 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 groundstation7)
   goals met: 0 of 8
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate satellite1 instrument1 groundstation7)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite1 phenomenon18 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 phenomenon18)
   goals met: 0 of 8
5. (take_image satellite1 phenomenon18 instrument1 spectrograph0)
   added: (have_image phenomenon18 spectrograph0)
   goals met: 1 of 8
6. (turn_to satellite1 phenomenon16 phenomenon18)
   deleted: (pointing satellite1 phenomenon18)
   added: (pointing satellite1 phenomenon16)
   goals met: 1 of 8
7. (turn_to satellite0 groundstation0 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 groundstation0)
   goals met: 2 of 8
8. (take_image satellite1 phenomenon16 instrument1 spectrograph0)
   added: (have_image phenomenon16 spectrograph0)
   goals met: 3 of 8
9. (turn_to satellite1 star12 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 star12)
   goals met: 3 of 8
10. (take_image satellite1 star12 instrument1 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 4 of 8
11. (switch_off instrument1 satellite1)
   deleted: (power_on instrument1)
   added: (power_avail satellite1)
   goals met: 4 of 8
12. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 4 of 8
13. (turn_to satellite1 groundstation0 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 groundstation0)
   goals met: 4 of 8
14. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 4 of 8
15. (turn_to satellite1 planet14 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet14)
   goals met: 4 of 8
16. (take_image satellite1 planet14 instrument3 infrared1)
   added: (have_image planet14 infrared1)
   goals met: 5 of 8
17. (turn_to satellite1 planet17 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet17)
   goals met: 5 of 8
18. (take_image satellite1 planet17 instrument3 infrared1)
   added: (have_image planet17 infrared1)
   goals met: 6 of 8
19. (turn_to satellite1 star13 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 star13)
   goals met: 6 of 8
20. (take_image satellite1 star13 instrument3 infrared1)
   added: (have_image star13 infrared1)
   goals met: 7 of 8
21. (turn_to satellite1 star15 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star15)
   goals met: 7 of 8
22. (take_image satellite1 star15 instrument3 infrared2)
   added: (have_image star15 infrared2)
   goals met: 8 of 8
